## Production: website
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                    NAME                    |
|--------|--------------------------------------------|
| add    | `aws_wafv2_web_acl.amplify_docs`           |
|        | `aws_wafv2_web_acl_association.amplify_en` |
|        | `aws_wafv2_web_acl_association.amplify_fr` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_wafv2_web_acl.amplify_docs will be created
  + resource "aws_wafv2_web_acl" "amplify_docs" {
      + application_integration_url = (known after apply)
      + arn                         = (known after apply)
      + capacity                    = (known after apply)
      + id                          = (known after apply)
      + lock_token                  = (known after apply)
      + name                        = "waf-gc-design-system-amplify-docs-production"
      + scope                       = "CLOUDFRONT"
      + tags                        = {
          + "CostCentre" = "gc-design-system-production"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "gc-design-system-production"
          + "Terraform"  = "true"
        }

      + default_action {
          + allow {
            }
        }

      + rule {
          + name     = "APIEndpointProtection"
          + priority = 5

          + action {
              + block {
                  + custom_response {
                      + response_code = 403
                    }
                }
            }

          + statement {
              + and_statement {
                  + statement {
                      + byte_match_statement {
                          + positional_constraint = "STARTS_WITH"
                          + search_string         = "/api/"

                          + field_to_match {
                              + uri_path {}
                            }

                          + text_transformation {
                              + priority = 0
                              + type     = "LOWERCASE"
                            }
                        }
                    }
                  + statement {
                      + not_statement {
                          + statement {
                              + regex_match_statement {
                                  + regex_string = "^/api/submission(/.*)?$"

                                  + field_to_match {
                                      + uri_path {}
                                    }

                                  + text_transformation {
                                      + priority = 0
                                      + type     = "LOWERCASE"
                                    }
                                }
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "gc-design-system-amplify-docs-api-endpoint-protection"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "BlockLargeRequests"
          + priority = 3

          + action {
              + block {
                }
            }

          + statement {
              + size_constraint_statement {
                  + comparison_operator = "GT"
                  + size                = 20480

                  + field_to_match {
                      + body {
                          + oversize_handling = "MATCH"
                        }
                    }

                  + text_transformation {
                      + priority = 0
                      + type     = "NONE"
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "gc-design-system-amplify-docs-block-large-requests"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "RateLimitRule"
          + priority = 2

          + action {
              + block {
                }
            }

          + statement {
              + rate_based_statement {
                  + aggregate_key_type    = "IP"
                  + evaluation_window_sec = 300
                  + limit                 = 100

                  + scope_down_statement {
                      + and_statement {
                          + statement {
                              + regex_match_statement {
                                  + regex_string = "^/api/submission(/.*)?$"

                                  + field_to_match {
                                      + uri_path {}
                                    }

                                  + text_transformation {
                                      + priority = 0
                                      + type     = "LOWERCASE"
                                    }
                                }
                            }
                          + statement {
                              + regex_match_statement {
                                  + regex_string = "^post$"

                                  + field_to_match {
                                      + method {}
                                    }

                                  + text_transformation {
                                      + priority = 0
                                      + type     = "LOWERCASE"
                                    }
                                }
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "gc-design-system-amplify-docs-rate-limit"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "SubmissionMethodRestriction"
          + priority = 4

          + action {
              + block {
                }
            }

          + statement {
              + and_statement {
                  + statement {
                      + regex_match_statement {
                          + regex_string = "^/api/submission(/.*)?$"

                          + field_to_match {
                              + uri_path {}
                            }

                          + text_transformation {
                              + priority = 0
                              + type     = "LOWERCASE"
                            }
                        }
                    }
                  + statement {
                      + not_statement {
                          + statement {
                              + byte_match_statement {
                                  + positional_constraint = "EXACTLY"
                                  + search_string         = "post"

                                  + field_to_match {
                                      + method {}
                                    }

                                  + text_transformation {
                                      + priority = 0
                                      + type     = "LOWERCASE"
                                    }
                                }
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "gc-design-system-amplify-docs-submission-method-restriction"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesCommonRuleSet"
          + priority = 0

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "gc-design-system-amplify-docs-common-rules"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesKnownBadInputsRuleSet"
          + priority = 1

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "gc-design-system-amplify-docs-known-bad-inputs"
              + sampled_requests_enabled   = true
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "gc-design-system-amplify-docs"
          + sampled_requests_enabled   = true
        }
    }

  # aws_wafv2_web_acl_association.amplify_en will be created
  + resource "aws_wafv2_web_acl_association" "amplify_en" {
      + id           = (known after apply)
      + resource_arn = "arn:aws:amplify:ca-central-1:307395567143:apps/djtlis5vpn8jd"
      + web_acl_arn  = (known after apply)
    }

  # aws_wafv2_web_acl_association.amplify_fr will be created
  + resource "aws_wafv2_web_acl_association" "amplify_fr" {
      + id           = (known after apply)
      + resource_arn = "arn:aws:amplify:ca-central-1:307395567143:apps/d35vdwuoev573o"
      + web_acl_arn  = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_amplify_app.design_system_docs_en"]
WARN - plan.json - main - Missing Common Tags: ["aws_amplify_app.design_system_docs_fr"]
WARN - plan.json - main - Missing Common Tags: ["aws_amplify_branch.main_en"]
WARN - plan.json - main - Missing Common Tags: ["aws_amplify_branch.main_fr"]

23 tests, 19 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
